In [34]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from pandas.tools.plotting import scatter_matrix
plt.style.use('ggplot')
%matplotlib

Using matplotlib backend: Qt5Agg

In [9]:
#  Корреляционный анализ

In [10]:
data = pd.read_csv('C:/Users/kotsi/Desktop/toy_dataset.csv')
data.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [21]:
data = data.drop('Number', 1)

In [22]:
data.describe()

                 Age         Income
count  150000.000000  150000.000000
mean       44.950200   91252.798273
std        11.572486   24989.500948
min        25.000000    -654.000000
25%        35.000000   80867.750000
50%        45.000000   93655.000000
75%        55.000000  104519.000000
max        65.000000  177157.000000

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 5 columns):
City       150000 non-null object
Gender     150000 non-null object
Age        150000 non-null int64
Income     150000 non-null float64
Illness    150000 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 5.7+ MB

In [14]:
cat_cols = [c for c in data.columns if data[c].dtype.name == 'object']
num_cols   = [c for c in data.columns if data[c].dtype.name != 'object']

In [15]:
data[cat_cols].describe()

                 City  Gender Illness
count          150000  150000  150000
unique              8       2       2
top     New York City    Male      No
freq            50307   83800  137861

In [24]:
data.at[data['Gender'] == 'Male', 'Gender'] = 0
data.at[data['Gender'] == 'Female', 'Gender'] = 1
data.at[data['Illness'] == 'No', 'Illness'] = 0
data.at[data['Illness'] == 'Yes', 'Illness'] = 1

In [26]:
data.head()

     City  Gender  Age   Income  Illness
0  Dallas       0   41  40367.0        0
1  Dallas       0   54  45084.0        0
2  Dallas       0   42  52483.0        0
3  Dallas       0   40  40941.0        0
4  Dallas       0   46  50289.0        0

In [37]:
#data_nonbinary = pd.get_dummies(data['City'])
#data_nonbinary.columns

In [32]:
data.corr()

           Gender       Age    Income   Illness
Gender   1.000000  0.003653 -0.198888 -0.001297
Age      0.003653  1.000000 -0.001318  0.001811
Income  -0.198888 -0.001318  1.000000  0.000298
Illness -0.001297  0.001811  0.000298  1.000000

In [36]:
print(data.corr()['Illness'].abs().sort_values(ascending=False).head(19))

Illness    1.000000
Age        0.001811
Gender     0.001297
Income     0.000298
Name: Illness, dtype: float64

In [35]:
sns.heatmap(data.corr())